pong-to-rich/k6/refresh-load-test/Redis-vu500-03.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)

INFO[0005] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<200' p(95)=445.63ms
    ✗ 'p(99)<400' p(99)=531.57ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_waiting
    ✗ 'p(95)<150' p(95)=444.95ms


  █ TOTAL RESULTS 

    checks_total.......: 102556  2848.148962/s
    checks_succeeded...: 100.00% 102556 out of 102556
    checks_failed......: 0.00%   0 out of 102556

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00% 0 out of 51278
    refresh_duration...............: avg=191.42ms min=28.57ms  med=118.63ms max=681.43ms p(90)=350.31ms p(95)=445.78ms

    HTTP
    http_req_duration..............: avg=191.16ms min=28.57ms  med=117.78ms max=681.43ms p(90)=350.12ms p(95)=445.63ms
      { expected_response:true }...: avg=191.16ms min=28.57ms  med=117.78ms max=681.43ms p(90)=350.12ms p(95)=445.63ms
    http_req_failed................: 0.00% 0 out of 51378
    http_reqs......................: 51378 1426.851646/s

    EXECUTION
    iteration_duration.............: avg=293.1ms  min=128.77ms med=222.48ms max=933.03ms p(90)=451.71ms p(95)=548.35ms
    iterations.....................: 51278 1424.074481/s
    vus............................: 379   min=0          max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 40 MB 1.1 MB/s
    data_sent......................: 18 MB 510 kB/s



running (0m36.0s), 000/500 VUs, 51278 complete and 0 interrupted iterations
default ✓ [======================================] 500 VUs  30s
ERRO[0036] thresholds on metrics 'http_req_duration, http_req_waiting' have been crossed